---
type: TriangulationInterfaceForTriangulatedSolidOrShell
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# TriangulationInterfaceForTriangulatedSolidOrShell

`Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TriangulationInterfaceForTriangulatedSolidOrShell | 2013 | `public TriangulationInterfaceForTriangulatedSolidOrShell ( TriangulatedSolidOrShell externalTriangulatedSolidOrShell )` |